src/cf/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСтола</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пожелание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученНаКухне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ЗаказКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьСтатусЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновитьСтатусЗаказаКлиента", 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновитьСтатусЗаказаКлиента", 2);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСтатусЗаказа();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьСтатусЗаказа(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, НСтр("ru='Заказ не создан, смена статуса невозможна'", "ru"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияФормы = ПараметрыОткрытияФормыРегистраСтатусыЗаказов(Объект.Ссылка);
	
	Если Не ПараметрыОткрытияФормы.РазрешеноИзменятьСтатусЗаказа Тогда
		ПоказатьПредупреждение(, НСтр("ru='Текущий статус заказа не может быть изменен'", "ru"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.СтатусыЗаказов.ФормаЗаписи", ПараметрыОткрытияФормы.Параметры, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтатусЗаказа()
	
	Статус = РегистрыСведений.СтатусыЗаказов.АктуальныйСтатусЗаказа(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияОбновитьСтатусЗаказаКлиента() Экспорт
	
	ЗаполнитьСтатусЗаказа();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОткрытияФормыРегистраСтатусыЗаказов(ЗаказКлиента)
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	РезультатПодготовкиПараметров = Новый Структура;
	РезультатПодготовкиПараметров.Вставить("РазрешеноИзменятьСтатусЗаказа", Истина);
	РезультатПодготовкиПараметров.Вставить("Параметры", ПараметрыОткрытияФормы);
	
	АктуальныйСтатусЗаказа = РегистрыСведений.СтатусыЗаказов.АктуальныйСтатусЗаказа(ЗаказКлиента);
	Если АктуальныйСтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.Готов Тогда
		НовыйСтатус = Перечисления.СтатусыЗаказовКлиентов.Подан;
	Иначе
		РезультатПодготовкиПараметров.РазрешеноИзменятьСтатусЗаказа = Ложь;
	КонецЕсли;
	
	Если РезультатПодготовкиПараметров.РазрешеноИзменятьСтатусЗаказа Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Заказ", ЗаказКлиента);
		ЗначенияЗаполнения.Вставить("Статус", НовыйСтатус);
		ПараметрыОткрытияФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	
	Возврат РезультатПодготовкиПараметров;
	
КонецФункции

#КонецОбласти
